IDEA Open Model
SetupValueBool Class
Compatible with IDEA StatiCa v 10.1
 Setup value bool
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.SetupValue
 IdeaRS.OpenModel.Concrete.SetupValueBool
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public class SetupValueBool : SetupValue
Public Class SetupValueBool
	Inherits SetupValue
public ref class SetupValueBool : public SetupValue
The SetupValueBool type exposes the following members.
Constructors
Name | Description
SetupValueBool
Initializes a new instance of the SetupValueBool class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from SetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace